#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # linode_lke_cluster.foobar will be created
  + resource "linode_lke_cluster" "foobar" {
      + api_endpoints = (known after apply)
      + dashboard_url = (known after apply)
      + id            = (known after apply)
      + k8s_version   = "1.23"
      + kubeconfig    = (sensitive value)
      + label         = "example-lke-cluster"
      + region        = "us-west"
      + status        = (known after apply)
      + tags          = [
          + "testing",
        ]

      + control_plane {
          + high_availability = (known after apply)
        }

      + pool {
          + count = 3
          + id    = (known after apply)
          + nodes = (known after apply)
          + type  = "g6-standard-2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_endpoints = (known after apply)
  + id            = (known after apply)
  + kubeconfig    = (sensitive value)
  + pool          = [
      + {
          + autoscaler = []
          + count      = 3
          + id         = (known after apply)
          + nodes      = (known after apply)
          + type       = "g6-standard-2"
        },
    ]
  + status        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jagadeeshbm3, Action: `pull_request`*